{
  "backend/main.mo": "Motoko canister defining access-controlled user profiles and a large set of crypto market, capital flow, and predictive analytics data types, with authorization mixins and basic profile CRUD endpoints.",
  "feature_evidence.json": "Placeholder feature evidence report JSON with no recorded features.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend source files, components, hooks, styles, PWA assets, and configuration.",
  "frontend/ANDROID_APK_BUILD_GUIDE.md": "Step-by-step guide (in Portuguese) for packaging the web dashboard into a native Android APK using Capacitor and Android Studio.",
  "frontend/index.css": "Global Tailwind CSS base defining light and dark theme design tokens using OKLCH colors, neon chart palettes, and core layout styling.",
  "frontend/index.html": "HTML entry point configured for a Portuguese-language PWA with full mobile, iOS, and desktop install metadata and asset links.",
  "frontend/public/manifest.json": "PWA manifest defining app identity, standalone display mode, icons, orientation, categories, and screenshots for installable use.",
  "frontend/src/App.tsx": "Root React component managing dark theme, PWA initialization, and navigation between five dashboard modules with header and footer.",
  "frontend/src/components/ConfluenceZones.tsx": "UI module that displays ranked confluence zones from backend data or synthesizes them from live Binance market data with loading, error, and live-status handling.",
  "frontend/src/components/FlowVisualization.tsx": "Visualizes capital flow data using backend flows or synthetic flows derived from live Binance data, animating and summarizing market behavior. It computes percentages, intensity, and an interpretation summary (e.g., BTC dominance, altcoin inflow, consolidation) and renders loading and alert states.",
  "frontend/src/components/Footer.tsx": "Renders a static footer with branding, a heart icon, a link to caffeine.ai, and a real-time data status indicator.",
  "frontend/src/components/GlobalFlowRadar.tsx": "File is currently empty and does not define any component or logic.",
  "frontend/src/components/Header.tsx": "Provides the application header with logo, live connection status from Binance, and navigation buttons to switch between major dashboard modules.",
  "frontend/src/components/PerformancePreditiva.tsx": "Displays predictive performance analytics by validating model projections against live Binance prices, including charts, metrics, target hit/miss evaluation, and asset selection.",
  "frontend/src/components/PredictiveIntelligence.tsx": "Shows predictive market projections using a safe fallback chain between backend data and synthetic Binance-derived projections, with synchronization gating, retry handling, and detailed target visualization.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Manages and displays a cross-platform PWA installation prompt with platform-specific logic, dismissal tracking, and fallback timers for iOS, Android, and desktop.",
  "frontend/src/components/RecoveryPanel.tsx": "React UI component that displays a recovery dashboard of crypto assets, sorted by recovery strength and styled by momentum, institutional signals, or strength tiers. It handles loading, error, and success states using cards, badges, and visual indicators.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using React Query, switching between anonymous and authenticated identities. It initializes access control and invalidates dependent queries whenever the actor or identity changes.",
  "frontend/src/hooks/useBinanceData.ts": "Hook that manages live Binance market data via WebSocket with a REST polling fallback, including connection status and caching across remounts. It exposes normalized live ticker data and update timestamps.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for Internet Identity, handling login, logout, identity persistence, and status flags. Wraps Dfinity AuthClient setup and exposes identity state through a React context and hook.",
  "frontend/src/hooks/useProjectionsSyncGate.ts": "Synchronization gate hook that determines readiness of projections based on Binance live data and backend query state. It manages timeouts, no-data conditions, and user-facing sync status messages.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks that fetch and enrich backend data (flows, projections, metrics) using the actor and live Binance prices. It merges on-chain or backend results with real-time market data and controls refetch behavior.",
  "frontend/src/index.css": "Tailwind CSS base file defining global theme variables (dark tech/neon palette), font setup, and custom utility classes for neon colors, borders, and glow shadows.",
  "frontend/src/lib/binanceService.ts": "Implements a Binance Futures WebSocket client with typed ticker/trade models, symbol whitelisting, connection status tracking, message parsing, and automatic reconnection logic.",
  "frontend/src/lib/formatters.ts": "Provides number, currency, percentage, compact (K/M/B), and rounding utilities formatted for the Portuguese (pt-BR) locale.",
  "frontend/src/lib/projections.ts": "Validates, sanitizes, and normalizes predictive market projections, including deterministic fallback target generation based on symbol, trend, and confidence.",
  "frontend/src/lib/pwaUtils.ts": "Utility helpers for PWA installability, device detection, standalone mode checks, and managing the install prompt lifecycle and related events.",
  "frontend/src/lib/symbols.ts": "Handles crypto symbol normalization between base and Binance quote formats, symbol matching, deterministic seeding, and trend-based target multipliers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/service-worker.ts": "Implements a PWA service worker with precaching, runtime/data caches, versioned cache cleanup, and intelligent fetch strategies (cache-first or network-first) based on asset type and API endpoints.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash routing, persist them in sessionStorage, retrieve/clear persisted values, and safely remove sensitive params from the URL.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content scanning, safelisted neon utility classes, plugins, and an extended theme using CSS variables for colors, layout, and design tokens.",
  "project_state.json": "Defines the project’s high-level state and feature inventory, describing Crypto Flow as a neon-themed Portuguese PWA dashboard using Binance Futures data and ICP backend, with versioned summaries of implemented features."
}