{
  "backend/main.mo": "Main Motoko actor implementing user profiles, Binance credentials management, capital flow tracking, predictive projections, regional flows, institutional alerts, recovery assets, confluence zones, and access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing confluence filtering logic, convergence calculation, and bubble visualization rendering in the useBubbleAssets hook and BubbleVisualization component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx with module tabs, Header with navigation, hooks for Binance data and queries, PWA configuration, service worker, and various visualization components with Portuguese labels and 2-decimal formatting.",
  "frontend/ANDROID_APK_BUILD_GUIDE.md": "Portuguese-language guide for building an Android APK from the web app using Capacitor, listing prerequisites including Node.js, Android Studio, and Java JDK 11+.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including neon colors, sidebar styles, and chart colors for the dashboard UI.",
  "frontend/index.html": "HTML entry point with English language, PWA meta tags, manifest link, theme color, and icon references for 192x192, 256x256, and 512x512 sizes with proper apple-touch-icon configuration.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons (192x192, 256x256, 512x512 with maskable variants), screenshots for desktop and mobile, standalone display mode, and English localization for crypto capital flow dashboard.",
  "frontend/src/App.tsx": "Main React app component with QueryClient provider, theme provider, module state management for four tabs (bubbles, flows, confluence, futures), standalone orderflow mode support, and PWA update toast integration.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "React component for managing Binance API credentials with save, remove, and test connection functionality, displaying configuration status, security notices, and form inputs for API key and secret.",
  "frontend/src/components/BubbleDetailPanel.tsx": "A side panel component that displays detailed information about a selected bubble asset, including price, volume, convergence score, trend indicators, and technical metrics. Uses live data from useAssetDetailData hook and provides formatted display of asset statistics.",
  "frontend/src/components/BubbleVisualization.tsx": "Main 3D visualization component using React Three Fiber to render floating bubbles representing crypto assets with high convergence. Includes orbit controls, lighting, and displays a detail panel when a bubble is clicked.",
  "frontend/src/components/ConfluenceZones.tsx": "Displays confluence zones where multiple trading indicators overlap, with fallback to synthetic zones generated from live Binance data when backend data is unavailable. Shows intensity-sorted zones with real-time detection status.",
  "frontend/src/components/FloatingBubble.tsx": "Individual 3D bubble component for the visualization, with floating animation, hover effects, and color/size mapping based on convergence data and trend. Displays asset symbol as text label.",
  "frontend/src/components/FlowVisualization.tsx": "Visualizes capital flows between assets with animated flow indicators, generates synthetic flows from Binance data when backend is unavailable, and provides market interpretation summaries based on flow patterns.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information, a link to caffeine.ai, and a real-time data status indicator.",
  "frontend/src/components/FuturesDashboard.tsx": "Dashboard for Binance futures trading that displays account overview, balances, and open positions. Requires API credentials and includes auto-refresh functionality with error handling.",
  "frontend/src/components/FuturesMonitor.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalFlowRadar.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Main application header with navigation buttons for four modules (Convergência, Fluxo de Capital, Zonas Técnicas, Order Flow), live connection status indicator, and login button. Displays connection status with color-coded indicators and handles module switching.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity that handles login/logout actions with loading states. Clears query cache on logout and retries login if user is already authenticated.",
  "frontend/src/components/OpenPositionsTable.tsx": "Displays Binance Futures open positions in card format with position details (size, entry price, leverage, PnL), risk insights, and warning alerts. Shows empty state when no positions exist and highlights positions with risk warnings.",
  "frontend/src/components/order-flow/AlertsPanel.tsx": "Displays a scrollable list of order flow alerts with severity-based color coding (critical/high/medium/low), timestamps, and a clear-all button.",
  "frontend/src/components/order-flow/ConfluencePanel.tsx": "Shows detected confluence events in a scrollable list with directional icons (buy/sell), severity badges, and timestamps, styled distinctly from alerts.",
  "frontend/src/components/order-flow/OrderFlowControlsBar.tsx": "Compact control bar for order flow monitoring with market selection (futures/spot), polling toggle, refresh button, settings toggle, and last-updated timestamp display.",
  "frontend/src/components/order-flow/orderFlowCopy.ts": "Centralized English UI strings and copy for the Order Flow Monitor, including labels, states, error messages, and troubleshooting tips.",
  "frontend/src/components/order-flow/OrderFlowSection.tsx": "Reusable card wrapper component providing consistent layout with title, optional icon, badge, and content area for order flow sections.",
  "frontend/src/components/order-flow/OrderFlowStatGrid.tsx": "Responsive grid layout component for displaying stat items with labels, values, optional icons, and configurable column counts (2/3/4).",
  "frontend/src/components/OrderFlowErrorBoundary.tsx": "React error boundary component that catches runtime errors in the Order Flow Monitor and displays a user-friendly fallback UI with retry and reload options. Includes troubleshooting tips for users.",
  "frontend/src/components/OrderFlowMonitor.tsx": "Real-time BTC order flow analysis component with market selection (futures/spot), configurable polling intervals, and threshold settings. Analyzes trades, calculates rolling stats, detects confluence events, and generates alerts using persisted localStorage configuration.",
  "frontend/src/components/PerformancePreditiva.tsx": "Empty file with no content.",
  "frontend/src/components/PredictiveIntelligence.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup with name (required) and email (optional) fields, using a mutation hook to save the profile and displaying toast notifications for success/error states.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Progressive Web App install prompt that detects platform (iOS/Android/Desktop) and shows appropriate installation instructions or native prompts. Handles dismissal with 3-day cooldown period and respects already-installed state.",
  "frontend/src/components/RecoveryPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAssetDetailData.ts": "Fetches comprehensive asset detail data including capital flow, confluence zones, and live market data (price, volume, price change) for a given bubble asset.",
  "frontend/src/hooks/useBinanceData.ts": "React hook that manages live Binance market data via WebSocket with fallback REST API polling, maintaining a module-level cache of price, volume, and change data for whitelisted symbols.",
  "frontend/src/hooks/useBinanceFuturesMonitor.ts": "React Query hooks for managing Binance API credentials and user profiles, including CRUD operations for credentials, connection testing, and profile management via the backend actor.",
  "frontend/src/hooks/useBinanceOrderFlow.ts": "React hook for polling public Binance order flow data (24h ticker, recent trades, book ticker) with fingerprint-based change detection to minimize unnecessary re-renders.",
  "frontend/src/hooks/useBubbleAssets.ts": "React Query hook that fetches bubble assets from the backend and enriches them with live Binance market data, falling back to synthetic bubbles generated from market movers when backend data is unavailable.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useOpenFuturesPositions.ts": "React Query hook that fetches open Binance futures positions from the backend with optional polling, requiring both authentication and configured Binance credentials.",
  "frontend/src/hooks/useOrderFlowStableMemory.ts": "Custom hook providing ref-based stable memory for order flow metrics (spread, stats, price, volume) that persists across renders without triggering re-renders, including rolling average calculations.",
  "frontend/src/hooks/useProjectionsSyncGate.ts": "Empty file with no content.",
  "frontend/src/hooks/usePWAUpdateToast.ts": "React hook that checks for PWA service worker updates on mount, periodically (every 5 minutes), and on controller changes, displaying a toast notification with update/dismiss actions when an update is available.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching capital flows, confluence zones, recovery assets, and regional data from the backend actor, enriching the data with live Binance market data and handling real-time updates with configurable refetch intervals.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme color variables using OKLCH color space, neon shadow utilities, terminal UI styles, and keyframe animations for radar sweep and flow pulse effects.",
  "frontend/src/lib/binanceDomains.ts": "Exports centralized base URLs for Binance public REST and WebSocket endpoints for spot and futures markets, emphasizing these are for public market data only without API key requirements.",
  "frontend/src/lib/binanceOrderFlowRest.ts": "Provides functions to fetch public Binance market data via REST API including 24h ticker, recent trades, and book ticker for both spot and futures markets without authentication.",
  "frontend/src/lib/binanceService.ts": "Implements a WebSocket client for real-time Binance futures market data streaming with REST API fallback, managing connections for whitelisted symbols and maintaining a module-level cache of market data.",
  "frontend/src/lib/bookConfluence.ts": "Analyzes order book dynamics by calculating spread metrics, tracking bid/ask trends, and detecting confluence events where trade flow imbalance aligns with book movements like spread tightening or bid/ask stepping.",
  "frontend/src/lib/bubbleLayout.ts": "Calculates 3D spherical positions for bubble visualization using golden ratio-based distribution with random offsets to prevent overlap and create organic layouts.",
  "frontend/src/lib/bubbleVisualMapping.ts": "Maps convergence metrics (flow, confluence, confidence) to bubble sizes (0.5-2.5 range) and trends to neon colors (green/red/yellow), with color interpolation utilities.",
  "frontend/src/lib/formatters.ts": "Provides Portuguese locale number formatting utilities with 2 decimal place maximum for currency, percentages, compact numbers (K/M/B), and rounding.",
  "frontend/src/lib/futuresPositionFormat.ts": "Formats futures position data (prices, sizes, leverage, PnL, liquidation) and provides color/label utilities for position sides and market types (USD-M/COIN-M).",
  "frontend/src/lib/orderFlowAlerts.ts": "Generates proxy alerts for potential liquidations, volume spikes, price spikes, and spread anomalies based on configurable thresholds and rolling window statistics.",
  "frontend/src/lib/orderFlowAnalysis.ts": "Analyzes trade data to classify buy/sell sides, calculate notional values, compute rolling window statistics, and detect large trade clusters for institutional activity identification.",
  "frontend/src/lib/orderFlowFingerprint.ts": "Generates lightweight fingerprints from order flow data (ticker, book, trade IDs) to detect meaningful changes and avoid unnecessary UI updates during polling.",
  "frontend/src/lib/positionInsights.ts": "Generates contextual insights for futures positions including high PnL warnings, liquidation risk proximity, entry distance analysis, and volatility indicators with severity levels.",
  "frontend/src/lib/projections.ts": "Empty file with no content.",
  "frontend/src/lib/pwaUtils.ts": "Manages PWA installation prompts, validates requirements (HTTPS, service worker), detects device types (mobile/desktop/iOS/Android), and checks standalone/display modes.",
  "frontend/src/lib/symbols.ts": "Defines whitelisted trading symbols (BTC, ETH, SOL, etc.) and provides normalization utilities to match symbols with or without USDT suffix.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/service-worker.ts": "Service worker implementation for PWA offline support with cache-first/network-first strategies, precaching assets, and handling install/activate/fetch events.",
  "frontend/src/surfaces/BubbleVisualizationTabSurface.tsx": "Tab surface displaying bubble visualization of asset convergence with live market data from Binance, showing connection status, alerts, and legend for trend interpretation.",
  "frontend/src/surfaces/CapitalFlowTabSurface.tsx": "Simple tab surface wrapper that renders the FlowVisualization component for capital flow analysis.",
  "frontend/src/surfaces/ConfluenceZonesTabSurface.tsx": "Simple tab surface wrapper that renders the ConfluenceZones component for technical analysis.",
  "frontend/src/surfaces/FuturesMonitorTabSurface.tsx": "Standalone tab surface for order flow monitoring with its own QueryClient, theme provider, header, error boundary, and reset functionality.",
  "frontend/src/utils/safeJson.ts": "Utility functions for safe JSON parsing and validation of threshold configurations (OrderFlow, Confluence, Alert) with defensive defaults.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting, persisting, and clearing parameters from both regular query strings and hash-based routing with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom neon color palette, OKLCH color system, container queries, typography, animations, and safelist for dynamic classes.",
  "project_state.json": "Project state file for a financial market data visualization app using floating bubbles to display crypto assets. Currently tracking an issue where no assets pass the confluence filter, showing \"Nenhum ativo com alta confluência encontrada\" message instead of displaying bubbles."
}