{
  "backend/main.mo": "Motoko canister implementing access‑controlled user profiles and many typed crypto‑analytics data structures.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/ANDROID_APK_BUILD_GUIDE.md": "Guide for building the web app as an Android APK using Capacitor.",
  "frontend/index.css": "Tailwind base/theme variable definitions and dark‑mode CSS for the frontend.",
  "frontend/index.html": "PWA‑ready HTML entry file with meta tags, icons, and bootstrap script.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, screenshots, and display settings.",
  "frontend/src/App.tsx": "Main React app switching between multi‑module mode and single‑tab Futures Monitor, with PWA setup and theming.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "UI panel for entering, saving, testing, and removing Binance API keys with validation and status display.",
  "frontend/src/components/ConfluenceZones.tsx": "Displays confluence zones from backend or synthetic data, handling loading, errors, and live/cache state.",
  "frontend/src/components/FlowVisualization.tsx": "Visualizes capital flow data or synthetic flows and generates an interpretation summary based on intensity patterns.",
  "frontend/src/components/Footer.tsx": "Simple footer showing branding, copyright, and real‑time data status.",
  "frontend/src/components/FuturesDashboard.tsx": "Shows futures account data including open positions, with polling, refresh, error handling, and credential checks.",
  "frontend/src/components/FuturesMonitor.tsx": "Wraps authentication, profile setup, credentials panel, and futures dashboard in a gated monitor view.",
  "frontend/src/components/GlobalFlowRadar.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/Header.tsx": "Renders the app header with module navigation and live Binance connection status indicators.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/OpenPositionsTable.tsx": "Displays Binance Futures open positions with formatted metrics, risk insights, and warnings.",
  "frontend/src/components/PerformancePreditiva.tsx": "Empty component placeholder.",
  "frontend/src/components/PredictiveIntelligence.tsx": "Empty component placeholder.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for user profile setup with name/email fields and mutation‑based save handling.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Shows a conditional PWA installation prompt with platform-specific logic and dismiss handling.",
  "frontend/src/components/RecoveryPanel.tsx": "Empty component placeholder.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useBinanceData.ts": "Manages live Binance market data via WebSocket with fallback REST polling and cached updates.",
  "frontend/src/hooks/useBinanceFuturesMonitor.ts": "React-query hooks for checking, adding, removing, and testing Binance credentials and managing user profiles through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider handling auth client setup, login, logout, and identity state.",
  "frontend/src/hooks/useOpenFuturesPositions.ts": "Fetches open Binance futures positions when authenticated and credentials exist, with error mapping and optional polling.",
  "frontend/src/hooks/useProjectionsSyncGate.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/usePWAUpdateToast.ts": "Checks for PWA updates and shows a persistent toast prompting the user to update.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks fetching and enriching various backend datasets, often augmented with live Binance data.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining color variables, utilities, animations, and component styles.",
  "frontend/src/lib/binanceService.ts": "Implements Binance Futures WebSocket client and related types, including reconnect logic and ticker parsing.",
  "frontend/src/lib/formatters.ts": "Provides Portuguese locale number, currency, percentage, compact number formatting, and rounding utilities.",
  "frontend/src/lib/futuresPositionFormat.ts": "Formats futures prices, sizes, leverage, PnL, colors, and market labels for UI display.",
  "frontend/src/lib/positionInsights.ts": "Generates trading insights based on position metrics and provides icon and color helpers.",
  "frontend/src/lib/projections.ts": "Empty placeholder file for future projection utilities.",
  "frontend/src/lib/pwaUtils.ts": "PWA installation, device detection, and install prompt handling utilities.",
  "frontend/src/lib/symbols.ts": "Defines whitelisted Binance symbols and a helper for symbol normalization.",
  "frontend/src/main.tsx": "Application entry point mounting React with Internet Identity and React Query providers.",
  "frontend/src/service-worker.ts": "Service worker implementing asset precaching, cache cleanup, and caching strategies for offline support.",
  "frontend/src/surfaces/FuturesMonitorTabSurface.tsx": "Standalone Futures Monitor layout with header, content, and footer.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, neon color safelist, custom OKLCH color tokens, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing Binance futures positions app, current features, issues, and pending requests for USD‑M/COIN‑M position reading and unified analysis."
}