{
  "backend/main.mo": "Motoko canister defining access control, user profile storage, and many crypto analytics types with basic profile CRUD guarded by authorization.",
  "feature_evidence.json": "Feature evidence report mapping features to related source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files.",
  "frontend/ANDROID_APK_BUILD_GUIDE.md": "Guide explaining how to package the web dashboard as a native Android APK using Capacitor.",
  "frontend/index.css": "Global Tailwind-based styling defining theme variables for light/dark modes with OKLCH colors.",
  "frontend/index.html": "HTML entrypoint defining PWA metadata, icons, splash screens, and loading the main React script.",
  "frontend/public/manifest.json": "PWA manifest defining name, icons, theme colors, screenshots, and display settings.",
  "frontend/src/App.tsx": "Main React app handling module switching, standalone order-flow mode, layout, and React Query setup.",
  "frontend/src/components/BinanceCredentialsPanel.tsx": "UI panel for managing Binance API credentials with save, remove, and connection‑test actions.",
  "frontend/src/components/ConfluenceZones.tsx": "Displays confluence zones from backend or generates synthetic ones from Binance data, handling loading, errors, and live status indicators.",
  "frontend/src/components/FlowVisualization.tsx": "Renders capital flow data with synthetic fallback generation and produces an interpretation summary based on flow intensity.",
  "frontend/src/components/Footer.tsx": "Static footer showing attribution, real‑time status indicator, and branding.",
  "frontend/src/components/FuturesDashboard.tsx": "Futures dashboard that checks Binance credentials, fetches open positions, handles errors, and displays balances and positions.",
  "frontend/src/components/FuturesMonitor.tsx": "Empty placeholder component.",
  "frontend/src/components/GlobalFlowRadar.tsx": "Empty placeholder component.",
  "frontend/src/components/Header.tsx": "Header with live connection status, navigation buttons, and branding for switching between modules.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and clearing cached queries.",
  "frontend/src/components/OpenPositionsTable.tsx": "Displays normalized futures positions with risk alerts, formatted metrics, and insights.",
  "frontend/src/components/OrderFlowErrorBoundary.tsx": "React error boundary that catches order-flow monitor failures and shows a fallback UI with retry and reload options.",
  "frontend/src/components/OrderFlowMonitor.tsx": "Main order‑flow monitoring component handling real‑time data, thresholds, alerts, confluence logic, settings, and polling control.",
  "frontend/src/components/PerformancePreditiva.tsx": "Empty component file.",
  "frontend/src/components/PredictiveIntelligence.tsx": "Empty component file.",
  "frontend/src/components/ProfileSetupModal.tsx": "Profile setup modal allowing users to submit name and email using a save‑profile mutation with validation and status feedback.",
  "frontend/src/components/PWAInstallPrompt.tsx": "PWA installation prompt that detects platform, handles native install events, fallback timers, and dismissal persistence.",
  "frontend/src/components/RecoveryPanel.tsx": "Empty component file.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useBinanceData.ts": "Hook providing live Binance market data via WebSocket with REST fallback, caching updates, and connection status handling.",
  "frontend/src/hooks/useBinanceFuturesMonitor.ts": "Provides React Query hooks for managing Binance credential storage, testing connections, and fetching/saving user profiles via the backend actor.",
  "frontend/src/hooks/useBinanceOrderFlow.ts": "Implements a polling hook that fetches public Binance order flow data (ticker, trades, book) without requiring credentials.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useOpenFuturesPositions.ts": "Fetches open Binance futures positions from the backend when authenticated and credentials exist, with optional polling.",
  "frontend/src/hooks/useProjectionsSyncGate.ts": "Empty file with no implementation.",
  "frontend/src/hooks/usePWAUpdateToast.ts": "Checks for PWA updates and shows a toast prompting the user to update when a new version is available.",
  "frontend/src/hooks/useQueries.ts": "Collection of data-fetching hooks that query backend flows, zones, and assets, enriching them with live Binance market data.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, utilities, animations, and styling for terminal-like UI components.",
  "frontend/src/lib/binanceDomains.ts": "Defines base URLs for Binance public REST and WebSocket endpoints used for market data.",
  "frontend/src/lib/binanceOrderFlowRest.ts": "Provides REST helpers to fetch Binance public market data including 24h ticker, recent trades, and book ticker with basic validation.",
  "frontend/src/lib/binanceService.ts": "Implements public Binance market data access including REST fallbacks, price fetching, symbol whitelisting, and WebSocket streaming (partially shown).",
  "frontend/src/lib/bookConfluence.ts": "Calculates spread metrics, book direction, and detects confluence events combining order flow imbalance with order book movements.",
  "frontend/src/lib/formatters.ts": "Utility functions for number, currency, percentage, compact number formatting, and rounding using Portuguese locale rules.",
  "frontend/src/lib/futuresPositionFormat.ts": "Formats futures position fields such as price, size, leverage, PnL, liquidation price, and returns color/style helpers.",
  "frontend/src/lib/orderFlowAlerts.ts": "Generates alerts for proxy liquidations, volume spikes, price spikes, and spread anomalies based on rolling order flow statistics.",
  "frontend/src/lib/orderFlowAnalysis.ts": "Provides utilities to classify trades, compute notional values, generate rolling window stats, and detect clusters of large trades.",
  "frontend/src/lib/positionInsights.ts": "Generates trading position insights based on PnL, liquidation risk, entry distance, and volatility, with helpers for icons and colors.",
  "frontend/src/lib/projections.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/pwaUtils.ts": "Implements PWA-related helpers including install prompts, environment checks, device detection, and display mode utilities.",
  "frontend/src/lib/symbols.ts": "Contains whitelisted trading symbols and a helper to normalize and compare ticker formats.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/service-worker.ts": "Defines a service worker handling asset precaching, cache cleanup, and adaptive caching strategies for APIs and static assets.",
  "frontend/src/surfaces/FuturesMonitorTabSurface.tsx": "Standalone UI surface rendering the order flow monitor with a minimal header, auth controls, and footer.",
  "frontend/src/utils/safeJson.ts": "Provides safe JSON parsing and validation utilities for user settings, including thresholds for order flow, confluence, and alerts.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters and flags, persisting them in sessionStorage, and clearing them, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, safelisted neon classes, and extended theme colors and settings.",
  "project_state.json": "Stores project metadata, architectural notes, issues, and feature requests related to fixing API integration and UI stability problems."
}