{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize Order Flow Monitor by hardening parsing, adding error fallbacks, and clarifying public Binance REST usage",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add defensive parsing/guards and an in-panel error fallback (with retry) so OrderFlowMonitor never renders as a black screen on malformed localStorage or missing/empty Binance REST data.",
      "acceptanceCriteria": [
        "If Binance endpoints fail or return unexpected shapes (e.g., bookTicker is null, recentTrades is empty), the OrderFlowMonitor still renders and shows an in-panel error/empty-state message (no blank/black content area).",
        "If localStorage contains invalid JSON for orderFlowThresholds/confluenceThresholds/alertThresholds, the component falls back to defaults without throwing.",
        "A thrown runtime error inside OrderFlowMonitor no longer results in a blank page; a fallback UI is displayed with a retry action (e.g., refresh/refetch)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/safeJson.ts",
          "operation": "create",
          "description": "Add small helpers to safely parse JSON (try/catch) and validate/merge objects with defaults for localStorage-backed settings (orderFlowThresholds, confluenceThresholds, alertThresholds)."
        },
        {
          "path": "frontend/src/components/OrderFlowErrorBoundary.tsx",
          "operation": "create",
          "description": "Create a React error boundary wrapper for OrderFlowMonitor that renders a user-visible fallback UI (within the tab content area) and provides a retry action to reset the boundary and trigger a refetch. Use existing shadcn-ui components already available in the project; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/OrderFlowMonitor.tsx",
          "operation": "modify",
          "description": "Harden OrderFlowMonitor against runtime crashes: replace direct JSON.parse(localStorage) with safe parsing + defaults, guard analysis computations when recentTrades is empty or bookTicker is null/invalid, and render an explicit empty-state panel (with retry/refetch) when analysis cannot be computed. Use existing shadcn-ui components already imported in this file; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/binanceOrderFlowRest.ts",
          "operation": "modify",
          "description": "Make REST fetchers return safe defaults for unexpected/empty payloads (e.g., ensure recentTrades is always an array; ensure bookTicker is either a valid object or null; treat empty arrays as null) so downstream render/analysis never throws."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the OrderFlowMonitor render path(s) with the new OrderFlowErrorBoundary (both multi-module mode and the single-tab FuturesMonitorTabSurface path if needed via composition) so any runtime render errors show a fallback UI instead of a blank page."
        },
        {
          "path": "frontend/src/surfaces/FuturesMonitorTabSurface.tsx",
          "operation": "modify",
          "description": "Ensure the standalone Order Flow Monitor surface also uses the OrderFlowErrorBoundary wrapper so errors are contained to an in-page fallback with a retry action. Use existing shadcn-ui components if needed; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Align frontend Binance usage to a consistent public-domain strategy and ensure order-flow fetching never uses/stores/sends Binance API keys for public market data calls.",
      "acceptanceCriteria": [
        "Frontend order-flow data fetching continues to use only public Binance endpoints and does not read/send stored Binance credentials for those calls.",
        "Backend private Binance calls use a consistent Binance domain strategy (no unexplained mismatch like api1.binance.com vs api.binance.com without fallback/justification in code comments).",
        "Any place where API keys are used is centralized and documented in code comments (what endpoint requires it, and what headers/signature are applied)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/binanceDomains.ts",
          "operation": "create",
          "description": "Centralize Binance base-domain constants for FRONTEND public market data only (spot REST, futures REST, futures WS) and add clear code comments distinguishing public (no key) usage. Keep this file explicitly free of any API-key logic."
        },
        {
          "path": "frontend/src/lib/binanceOrderFlowRest.ts",
          "operation": "modify",
          "description": "Refactor to use shared public-domain constants (from binanceDomains.ts), add comments clarifying these are public/no-key calls, and ensure no request code reads from localStorage or interacts with the backend/credentials."
        },
        {
          "path": "frontend/src/lib/binanceService.ts",
          "operation": "modify",
          "description": "Refactor WebSocket + REST fallback base URLs to use the shared public-domain constants (from binanceDomains.ts) and add comments clarifying no API keys are ever sent from the frontend for market data."
        },
        {
          "path": "frontend/src/hooks/useBinanceOrderFlow.ts",
          "operation": "modify",
          "description": "Add a brief in-code contract comment that this hook performs only public market data fetching and must never depend on Binance credentials. Ensure error messages remain user-safe and do not suggest adding API keys for order-flow data."
        },
        {
          "path": "frontend/src/components/BinanceCredentialsPanel.tsx",
          "operation": "modify",
          "description": "Update copy/comments to clearly communicate that Binance credentials are for private account features (e.g., futures positions) and are not required for public Order Flow Monitor market data. Use existing shadcn-ui components already present in this file; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}