{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unified Futures Positions UI (fetch, refresh, polling, table, and deterministic insights)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add React Query hook to fetch unified futures positions with manual refresh and safe polling while Futures Dashboard is visible.",
      "acceptanceCriteria": [
        "When Binance credentials are configured, the Futures Dashboard loads positions from the backend and shows a loading state during fetch.",
        "Clicking the “Refresh” button triggers an immediate refetch and updates the UI.",
        "Polling/refetching does not run when the user is not authenticated or when credentials are missing.",
        "Errors from the backend are displayed in the UI in English with an actionable message (e.g., missing credentials, Binance request failed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useOpenFuturesPositions.ts",
          "operation": "create",
          "description": "Create a dedicated React Query hook that calls the backend actor getOpenFuturesPositions() and supports: (1) manual refetch, (2) safe polling (refetchInterval) only when the Futures Dashboard is mounted/visible, (3) query enablement gated by Internet Identity authentication state and hasBinanceCredentials(), and (4) standardized error mapping to English actionable messages. Use the core-infrastructure actor access pattern (via existing useActor). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/FuturesDashboard.tsx",
          "operation": "modify",
          "description": "Wire the new useOpenFuturesPositions hook into the dashboard: show a loading state during fetch, connect the existing Refresh button to query.refetch(), and ensure polling is enabled only when the user is authenticated and Binance credentials exist (otherwise disabled). Surface any backend errors as an English alert with next-step guidance (e.g., configure credentials / retry). Use existing shadcn-ui components (e.g., Alert, Button) without editing files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Replace the placeholder Open Positions panel with a unified USD-M + COIN-M positions table/list showing key fields and market type.",
      "acceptanceCriteria": [
        "The Open Positions section shows a unified list combining USD-M and COIN-M positions.",
        "Each row clearly indicates whether the position is USD-M or COIN-M.",
        "If there are no open positions, the UI shows an explicit empty state (in English) rather than placeholder text.",
        "Displayed numeric values are formatted consistently and remain readable in the existing neon/dark theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OpenPositionsTable.tsx",
          "operation": "create",
          "description": "Add a reusable OpenPositionsTable component that renders the unified positions list in a readable neon/dark theme-friendly layout (table or list). Display at minimum: symbol, positionSide/positionAmt, entryPrice, markPrice, pnl (unrealized), leverage, liquidationPrice (when present/meaningful), and market type (USD-M vs COIN-M). Use existing shadcn-ui building blocks (e.g., Card/Table/Badge if available, otherwise semantic markup + existing Tailwind utilities) without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/futuresPositionFormat.ts",
          "operation": "create",
          "description": "Create formatting helpers for futures positions to keep numeric output consistent and readable (e.g., price, size, leverage, PnL), with English-friendly formatting where appropriate, and safe handling of missing/zero liquidation price. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/FuturesDashboard.tsx",
          "operation": "modify",
          "description": "Replace the current Open Positions placeholder content with the new OpenPositionsTable component wired to the unified positions query data. Add an explicit empty state message in English when the returned list is empty. Ensure the market type is clearly labeled per row (USD-M / COIN-M) and formatting uses the shared helpers. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Generate deterministic per-position insights/tips (no AI) from unified position fields and display them in the Open Positions UI.",
      "acceptanceCriteria": [
        "For each open position, the UI can display zero or more generated “insights”/tips derived from the live position fields.",
        "Tips include at least these categories: (1) high PnL suggestion, (2) liquidation risk proximity, (3) entry vs mark distance, (4) mark price movement hint.",
        "Tips are deterministic from the data (same input => same output) and do not require any external AI/LLM integration.",
        "The UI copy is in English and uses cautious language (e.g., “Consider…”, “Risk: …”) rather than claiming certainty."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/positionInsights.ts",
          "operation": "create",
          "description": "Implement deterministic insight generation utilities for a NormalizedFuturesPosition. Include rules for: high unrealized PnL (suggest partial profit-taking), liquidation proximity (risk warning based on distance between mark and liquidation adjusted for side), large entry vs mark distance (position drift note), and mark price movement/volatility hint (e.g., large % move from entry implying elevated volatility/need to review risk). Ensure outputs are stable, purely data-driven, and English cautious wording. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/OpenPositionsTable.tsx",
          "operation": "modify",
          "description": "Integrate the insight generator to display zero or more tips per position (e.g., below the row or in a dedicated column/section). Optionally add a small summary (e.g., count of positions with liquidation warnings / high PnL) without introducing new top-level routes. Use existing shadcn-ui components for visual emphasis where appropriate, without editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}