{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix confluence filtering to display assets in bubble visualization",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix confluence filtering logic in useBubbleAssets hook to ensure assets with convergence data are properly displayed",
      "acceptanceCriteria": [
        "Bubble visualization displays assets from Binance market data",
        "No 'Nenhum ativo com alta confluência encontrada' error message when valid assets exist",
        "Assets with any convergence score are visible in the 3D bubble view",
        "Confluence filtering threshold is properly configured or adjusted to show available assets"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBubbleAssets.ts",
          "operation": "modify",
          "description": "Review and fix the confluence filtering logic that determines which assets are displayed in the bubble visualization. Investigate the current filtering threshold and convergence score calculations to identify why valid assets are being filtered out. Adjust the filtering criteria to ensure assets with any meaningful convergence data (from confluenceIntensity, flowIntensity, or confidenceLevel fields) are included in the returned array. If a minimum threshold is required, set it to a reasonable low value (e.g., > 0) rather than an arbitrary high value that excludes all assets. Ensure the hook properly merges backend bubble asset data with live Binance market data and that the filtering happens after enrichment with live prices."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Review and adjust convergence calculation logic to ensure proper evaluation of assets based on Binance data",
      "acceptanceCriteria": [
        "Convergence scores are calculated from real Binance market data",
        "Assets with significant price movement or volume are assigned appropriate convergence values",
        "Filtering logic allows assets to pass through when they meet reasonable convergence thresholds"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBubbleAssets.ts",
          "operation": "modify",
          "description": "Examine how convergence/confluence metrics are derived from the enriched asset data. Verify that confluenceIntensity, flowIntensity, and confidenceLevel values are being properly calculated or passed through from the backend BubbleAsset type. If these values are consistently zero or undefined, investigate whether the backend is returning valid data or if the enrichment process with live Binance data (price changes, volume) needs to contribute to these metrics. Ensure that assets with significant 24h price changes or volume from Binance WebSocket/REST data are assigned non-zero convergence values if backend data is missing or incomplete."
        },
        {
          "path": "frontend/src/lib/bubbleVisualMapping.ts",
          "operation": "modify",
          "description": "Review the bubble visual mapping logic that converts convergence metrics to bubble sizes and colors. Verify that the mapping functions handle edge cases where convergence values might be low but non-zero, and that the visual representation scales appropriately across the full range of possible values. Ensure that bubbles with minimal but valid convergence data are still rendered with visible sizes and colors rather than being effectively invisible."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure BubbleVisualization component properly renders bubbles with appropriate error handling",
      "acceptanceCriteria": [
        "Empty state message only appears when genuinely no data is available from Binance",
        "Bubbles render correctly when useBubbleAssets returns valid asset array",
        "Error states distinguish between API failures and filtering logic issues"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BubbleVisualization.tsx",
          "operation": "modify",
          "description": "Review the empty state logic that displays 'Nenhum ativo com alta confluência encontrada'. Verify the condition that triggers this message - it should only appear when the asset array from useBubbleAssets is genuinely empty due to no data from Binance, not when filtering has incorrectly excluded valid assets. Add conditional logic to distinguish between: (1) no backend/Binance data available (legitimate empty state), (2) data exists but all filtered out (filtering issue - add a different message or lower the threshold), and (3) loading states. Consider adding a debug log or development-mode indicator showing how many assets were fetched before and after filtering to help diagnose the issue."
        },
        {
          "path": "frontend/src/surfaces/BubbleVisualizationTabSurface.tsx",
          "operation": "modify",
          "description": "Enhance error handling and status messaging in the tab surface to provide clearer feedback about data availability versus filtering issues. If useBubbleAssets returns an empty array but Binance data is available, display a helpful message indicating that filtering might be too strict. Add a live status indicator showing both Binance connection status and the count of assets available before/after filtering to help users understand why bubbles might not be appearing."
        }
      ]
    }
  ]
}