{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [
    "Aplicativo utiliza múltiplas chaves de API; necessário padronizar onde são definidas/lidas (front e back-end) e como são selecionadas por ambiente/serviço."
  ],
  "known_issues": [
    "Nova aba 'monitor de fluxo de ordens' fica preta ~1s após abrir, aparentemente quando o front-end tenta se comunicar com o back-end (possível problema na integração/uso de chaves de API)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-prevent-the-order-flow-monitor-ui-from-crashing-black-screen-when-binance-rest-responses-are-missing-empty-or-when-saved-localstorage-settings-are-malformed-by-adding-defensive-parsing-guards-and-a-user-visible-error-fallback-instead-of-an-unhandled-react-render-error",
      "title": "Prevent the \"Order Flow Monitor\" UI from crashing (black screen) when Binance REST responses are missing/empty or when saved localStorage settings are malformed, by adding defensive parsing/guards and a user-visible error fallback instead of an unhandled React render error.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-audit-and-align-frontend-vs-backend-binance-api-usage-so-the-app-does-not-mix-inconsistent-base-domains-endpoints-and-clearly-separates-public-no-key-vs-private-key-secret-calls-ensure-the-frontend-order-flow-tab-never-requires-binance-api-keys-to-fetch-public-market-data",
      "title": "Audit and align frontend vs backend Binance API usage so the app does not mix inconsistent base domains/endpoints and clearly separates public (no key) vs private (key/secret) calls; ensure the frontend order-flow tab never requires Binance API keys to fetch public market data.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Auditar integração de APIs no front-end e back-end (leitura/uso de múltiplas chaves de API) e corrigir inconsistências que causam falha na nova aba.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Fix backend Binance private API implementation inconsistencies: remove placeholder example positions and implement real fetching/parsing for open futures positions using the stored apiKey/apiSecret (including required signing if the endpoint requires it), returning normalized positions consistent with the frontend types.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Audit and fix API integration inconsistencies causing the Order Flow Monitor tab to go black",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}